# Dictionary to map Hiragana characters and combinations to their ASCII equivalents
hiragana_to_ascii = {
    'あ': 'a', 'い': 'i', 'う': 'u', 'え': 'e', 'お': 'o',
    'か': 'ka', 'き': 'ki', 'く': 'ku', 'け': 'ke', 'こ': 'ko',
    'さ': 'sa', 'し': 'shi', 'す': 'su', 'せ': 'se', 'そ': 'so',
    'た': 'ta', 'ち': 'chi', 'つ': 'tsu', 'て': 'te', 'と': 'to',
    'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no',
    'は': 'ha', 'ひ': 'hi', 'ふ': 'fu', 'へ': 'he', 'ほ': 'ho',
    'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo',
    'や': 'ya', 'ゆ': 'yu', 'よ': 'yo',
    'ら': 'ra', 'り': 'ri', 'る': 'ru', 'れ': 're', 'ろ': 'ro',
    'わ': 'wa', 'を': 'wo', 'ん': 'n',
    'が': 'ga', 'ぎ': 'gi', 'ぐ': 'gu', 'げ': 'ge', 'ご': 'go',
    'ざ': 'za', 'じ': 'ji', 'ず': 'zu', 'ぜ': 'ze', 'ぞ': 'zo',
    'だ': 'da', 'ぢ': 'ji', 'づ': 'zu', 'で': 'de', 'ど': 'do',
    'ば': 'ba', 'び': 'bi', 'ぶ': 'bu', 'べ': 'be', 'ぼ': 'bo',
    'ぱ': 'pa', 'ぴ': 'pi', 'ぷ': 'pu', 'ぺ': 'pe', 'ぽ': 'po',
    'きゃ': 'kya', 'きゅ': 'kyu', 'きょ': 'kyo',
    'しゃ': 'sha', 'しゅ': 'shu', 'しょ': 'sho',
    'ちゃ': 'cha', 'ちゅ': 'chu', 'ちょ': 'cho',
    'にゃ': 'nya', 'にゅ': 'nyu', 'にょ': 'nyo',
    'ひゃ': 'hya', 'ひゅ': 'hyu', 'ひょ': 'hyo',
    'みゃ': 'mya', 'みゅ': 'myu', 'みょ': 'myo',
    'りゃ': 'rya', 'りゅ': 'ryu', 'りょ': 'ryo',
    'ぎゃ': 'gya', 'ぎゅ': 'gyu', 'ぎょ': 'gyo',
    'じゃ': 'ja', 'じゅ': 'ju', 'じょ': 'jo',
    'びゃ': 'bya', 'びゅ': 'byu', 'びょ': 'byo',
    'ぴゃ': 'pya', 'ぴゅ': 'pyu', 'ぴょ': 'pyo'
}

# 1005
KYOUIKU_STR = "一右雨円王音下火花貝学気休玉金九空月犬見五口校左三山四子糸字耳七車手十出女小上森人水正生青石赤先千川早草足村大男竹中虫町天田土二日入年白八百文本名木目夕立力林六引羽雲園遠黄何夏家科歌画会回海絵外角楽活間丸岩顔帰汽記弓牛魚京強教近兄形計元原言古戸午後語交光公工広考行高合国黒今才細作算姉市思止紙寺時自室社弱首秋週春書少場色食心新親図数星晴声西切雪線船前組走多太体台谷知地池茶昼朝長鳥直通弟店点電冬刀東当答頭同道読内南肉馬買売麦半番父風分聞米歩母方北妹毎万明鳴毛門夜野矢友曜用来理里話悪安暗委意医育員飲院運泳駅横屋温化荷界開階寒感漢館岸期起客宮急球究級去橋業局曲銀区苦具君係軽決血研県庫湖向幸港号根祭坂皿仕使始指死詩歯事持次式実写者主取守酒受州拾終習集住重宿所暑助勝商昭消章乗植深申真神身進世整昔全想相送息速族他打対待代第題炭短談着柱注丁帳調追定庭笛鉄転登都度島投湯等豆動童農波配倍箱畑発反板悲皮美鼻筆氷表病秒品夫負部服福物平返勉放味命面問役薬油有由遊予様洋羊葉陽落流旅両緑礼列練路和愛案以位囲胃衣印栄英塩央億加果課貨芽改械害街各覚完官管観関願喜器希旗機季紀議救求泣給挙漁競共協鏡極訓軍郡型径景芸欠結健建験固候功好康航告差最菜材昨刷察札殺参散産残司史士氏試児治辞失借種周祝順初唱松焼照省笑象賞信臣成清静席積折節説戦浅選然倉巣争側束続卒孫帯隊達単置仲貯兆腸低停底的典伝徒努灯働堂得特毒熱念敗梅博飯費飛必標票不付府副粉兵別変辺便包法望牧末満未脈民無約勇要養浴利陸料良量輪類令例冷歴連労老録圧易移因営永衛液益演往応恩仮価可河過賀解快格確額刊幹慣眼基寄規技義逆久旧居許境興均禁句群経潔件券検険減現限個故護効厚構耕講鉱混査再妻採災際在罪財桜雑賛酸師志支枝資飼似示識質舎謝授修術述準序承招証常情条状織職制勢性政精製税績責接設絶舌銭祖素総像増造則測属損態貸退団断築張提程敵適統導銅徳独任燃能破判版犯比肥非備俵評貧婦富布武復複仏編弁保墓報豊暴貿防務夢迷綿輸余預容率略留領異遺域宇映延沿我灰拡閣革割株巻干看簡危揮机貴疑吸供胸郷勤筋敬系警劇激穴憲権絹厳源呼己誤后孝皇紅鋼降刻穀骨困砂座済裁策冊姿私至視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除傷将障城蒸針仁垂推寸盛聖誠宣専泉洗染善創奏層操窓装臓蔵存尊宅担探誕暖段値宙忠著庁潮頂賃痛展党糖討届難乳認納脳派俳拝背肺班晩否批秘腹奮並閉陛片補暮宝訪亡忘棒枚幕密盟模訳優郵幼欲翌乱卵覧裏律臨朗論"
SILKWORM = "蚕"

# 1135
JOYO_STR = "亜哀握扱依偉威尉慰為維緯違井壱逸稲芋姻陰隠韻渦浦影詠鋭疫悦謁越閲宴援炎煙猿縁鉛汚凹奥押欧殴翁沖憶乙卸穏佳嫁寡暇架禍稼箇華菓蚊雅餓介塊壊怪悔懐戒拐皆劾慨概涯該垣嚇核殻獲穫較郭隔岳掛潟喝括渇滑褐轄且刈乾冠勘勧喚堪寛患憾換敢棺款歓汗環甘監緩缶肝艦貫還鑑閑陥含頑企奇岐幾忌既棋棄祈軌輝飢騎鬼偽儀宜戯擬欺犠菊吉喫詰却脚虐丘及朽窮糾巨拒拠虚距享凶叫峡恐恭挟況狂狭矯脅響驚仰凝暁斤琴緊菌襟謹吟駆愚虞偶遇隅屈掘靴繰桑勲薫傾刑啓契恵慶憩掲携渓継茎蛍鶏迎鯨撃傑倹兼剣圏堅嫌懸献肩謙賢軒遣顕幻弦玄孤弧枯誇雇顧鼓互呉娯御悟碁侯坑孔巧恒慌抗拘控攻更江洪溝甲硬稿絞綱肯荒衡貢購郊酵項香剛拷豪克酷獄腰込墾婚恨懇昆紺魂佐唆詐鎖債催宰彩栽歳砕斎載剤咲崎削搾索錯撮擦傘惨桟暫伺刺嗣施旨祉紫肢脂諮賜雌侍慈滋璽軸執湿漆疾芝赦斜煮遮蛇邪勺爵酌釈寂朱殊狩珠趣儒寿需囚愁秀臭舟襲酬醜充柔汁渋獣銃叔淑粛塾俊瞬准循旬殉潤盾巡遵庶緒叙徐償匠升召奨宵尚床彰抄掌昇晶沼渉焦症硝礁祥称粧紹肖衝訟詔詳鐘丈冗剰壌嬢浄畳譲醸錠嘱飾殖触辱伸侵唇娠寝審慎振浸紳薪診辛震刃尋甚尽迅陣酢吹帥炊睡粋衰遂酔錘随髄崇枢据杉澄瀬畝是姓征牲誓請逝斉隻惜斥析籍跡拙摂窃仙占扇栓潜旋繊薦践遷銑鮮漸禅繕塑措疎礎租粗訴阻僧双喪壮捜掃挿曹槽燥荘葬藻遭霜騒憎贈促即俗賊堕妥惰駄耐怠替泰滞胎袋逮滝卓択拓沢濯託濁諾但奪脱棚丹嘆淡端胆鍛壇弾恥痴稚致遅畜蓄逐秩窒嫡抽衷鋳駐弔彫徴懲挑眺聴脹超跳勅朕沈珍鎮陳津墜塚漬坪釣亭偵貞呈堤帝廷抵締艇訂逓邸泥摘滴哲徹撤迭添殿吐塗斗渡途奴怒倒凍唐塔悼搭桃棟盗痘筒到謄踏逃透陶騰闘洞胴峠匿督篤凸突屯豚曇鈍縄軟尼弐如尿妊忍寧猫粘悩濃把覇婆廃排杯輩培媒賠陪伯拍泊舶薄迫漠爆縛肌鉢髪伐罰抜閥伴帆搬畔繁般藩販範煩頒盤蛮卑妃彼扉披泌疲碑罷被避尾微匹姫漂描苗浜賓頻敏瓶怖扶敷普浮符腐膚譜賦赴附侮舞封伏幅覆払沸噴墳憤紛雰丙併塀幣弊柄壁癖偏遍舗捕穂募慕簿倣俸奉峰崩抱泡砲縫胞芳褒邦飽乏傍剖坊妨帽忙房某冒紡肪膨謀僕墨撲朴没堀奔翻凡盆摩磨魔麻埋膜又抹繭慢漫魅岬妙眠矛霧婿娘銘滅免茂妄猛盲網耗黙戻紋匁厄躍柳愉癒諭唯幽悠憂猶裕誘雄融与誉庸揚揺擁溶窯謡踊抑翼羅裸頼雷絡酪欄濫吏履痢離硫粒隆竜慮虜了僚寮涼猟療糧陵倫厘隣塁涙累励鈴隷零霊麗齢暦劣烈裂廉恋錬炉露廊楼浪漏郎賄惑枠湾腕媛怨鬱唄淫咽茨彙椅萎畏嵐宛顎曖挨韓鎌葛骸蓋崖諧潰瓦牙苛俺臆岡旺艶稽憬詣熊窟串惧錦僅巾嗅臼畿亀伎玩挫沙痕頃駒傲乞喉梗虎股舷鍵拳桁隙呪腫嫉叱鹿餌摯恣斬拶刹柵埼塞采戚脊醒凄裾須腎芯尻拭憧蹴羞袖汰遜捉踪痩爽遡狙膳箋詮腺煎羨鶴爪椎捗嘲貼酎緻綻旦誰戴堆唾鍋謎梨奈那丼貪頓栃瞳藤賭妬填溺諦阜訃肘膝眉斑阪汎氾箸剥罵捻虹匂喩闇弥冶麺冥蜜枕昧勃頬貌蜂蔑璧餅蔽脇麓籠弄呂瑠瞭侶慄璃藍辣拉沃瘍妖湧柿哺楷睦釜錮賂毀勾曽"

# 861
JINMEIYOU_STR = "丑丞乃之乎乘也云亙亘些亞亥亦亨亮來仔伊伍伽佃佑伶佛侃侑俄俣俐侮俠倖倭俱倦偲傭傳僞僧價儉儲允尭兎兒兜其巽冨冴凌凉凛凜凱凧凪凰函剩劉劍劫勁勉勤勳勺勿匁匡廿卑卜卯卷卽卿厩厨叉叡叢叶只吾吻吞哉哨啄哩喬喰喧喋單嘩嘉嘗噌嘆噂器嚴圃圈國圓團圭坐坦埴堵埜堰堺堯塙增墨壕壘壞壬壯壽夷奄奎套奧奬娃姥姪娩嬉孃孜孟宏宋宕宥寅寓實寢寬寵將專尖尤屑層峨峻峯峽崚嵯嵩嶋嶺巌巖巢巷巳巴已帖帶幌幡庄庇庚庵廊廟廣廳廻弘弛彈彌彗彦彪彬從徠徵德徽怜恢恰恆悌悔惟惚惇惺愼憎憐懷忽恕悉惹惣惡惠慧應懲戊或戟戰戲托拔拂按挺掬捷捺挽捧掠捲揃搜揭搖摺摑撒撰撞播撫擢攝拜擊敍收敏敦斐斡斧斯於旭昂昏昌昊昴晦晃晒晋晏晄晟晝晨晚智暉暑暢曉曆曙曝曳曾朋朔朗杏杖杜李杵杭杷枇柑柘柏柊柾柚桔桐栗桂柴栖桧栞梓桶梶椛梧梢梯梁條梛梅棲椋椀榊楯楚楕槌椿楢楠楓楊椰榎樺榛槍樋槙榮槇樫樟槻樂樣橘檎樽橙橫櫛檀檜檢櫂櫓櫻欄欣欽盜歎此步歷殆毅每毘毬氣汀汲汐汝沌沫洲洛洸洵浬浩海涉淳渚淀淋淨淚渥湘湛淵湊渚渴溢溜漣滉溫漕漱滯漢澁澪濡濕瀧瀨瀕灘沓灸灼焚煉焰煤煌燈燒燎燦燭燿烏煮熙燕爭爲爾牒牟牡牽犀狼狹猪猪獅狀默獸玖珂珊玲珈珀琢琉瑛琶琵琳琥琢瑚瑞瑶瑳瓜瓢甥甫畠畢疊疋疏瘦皐皓盃盡眞眸瞥矩砧砥砦硯碓碗碎碑碩碧磐磯祁祇祢祐祷禄禎禰社祉祈祕祐祖祝神祥祿禍禎福禪禮禱禽禾秦秤稀稔稜稟稻穀穗穣穰穹突窄穿窪窺竣竪竺竿笈笠笹笙筑筈箔箕篇節篠簞簾籾粟粥粹糊紘紗紐絃紬絆絢綾綜綴緋綺綸綠緖緣練縞縣縱繁繡繫纂纏纖署羚翔翠耀者而耶耽聡聽肇肋肴胤胡脩腔脹膏臟臥臭與舜舵芦芥芹芭芙苑茄茅苔苺茉茜茸荻莞莫莊莉菖菅萄菱菩萌菫萠萊葵萱董萩葡葺萬著葦蒲蒔蒐蒼蓬蓑蒙蓉蓮蔭蔦蔓蔣蕎蕉蕃蕪蕨薗薙蕗蕾薩藁藏薰藝藥蘇蘭虛虜蝦蝶螺蟬蟹蠟衞衿袴裡襖袈裟裝裳視覽訊訣註詫詢誼諏諒諄謂諺諸謁謠謹讃讓豹貰賑賓賣賴贈赳跨蹄蹟輔輯輿轉轟辰辻迂辿迄迦迪逢逗這遁遥遼逞逸遙郁郞都鄭邑酉醇醉醐醍醬釀釉釘釧銑鋒鋸錆錫錐錘錄鍬鍊鎧鎭鑄閃閏閤阿陀陷隈險隼雀雁雛雜難雫霞靖靜鞄鞍鞘鞠鞭響頁頌頗顚類顯颯飜饗馨馳馴駕駈駿騷驍驗髮魁魯鮎鯉鯛鰯鱒鱗鳩鳶鳳鴨鴻鵜鵬鷄鷗鷲鷺鷹麒麟麿黃黎黛黑鼎齊龍"

#print('KYOUIKU_STR', len(KYOUIKU_STR))
#print('JOYO_STR', len(JOYO_STR))
#print('JINMEIYOU_STR', len(JINMEIYOU_STR))

def is_kanji(char):
    return '\u4e00' <= char <= '\u9faf' or '\u3400' <= char <= '\u4dbf'

def hiragana_to_romaji(hiragana_text):
    romaji_text = ''
    small_tsu = False
    i = 0
    while i < len(hiragana_text):
        if i + 1 < len(hiragana_text) and hiragana_text[i:i+2] in hiragana_to_ascii:
            word = hiragana_to_ascii[hiragana_text[i:i+2]]
            if small_tsu:
                romaji_text += word[0]
                small_tsu = False
            romaji_text += word
            i += 2
        elif hiragana_text[i] == 'っ':
            small_tsu = True
            i += 1
        elif hiragana_text[i] in hiragana_to_ascii:
            word = hiragana_to_ascii[hiragana_text[i]]
            if small_tsu:
                romaji_text += word[0]
                small_tsu = False
            romaji_text += word
            i += 1
        else:
            # romaji_text += hiragana_text[i]
            i += 1

    return romaji_text


u_to_a_dict = {
    'う': 'わ',
    'く': 'か',
    'す': 'さ',
    'つ': 'た',
    'ぬ': 'な',
    'む': 'ま',
    'む': 'ま',
    'ゆ': 'や',
    'る': 'ら',
    'ぐ': 'が',
    'ず': 'ざ',
    'づ': 'だ',
    'ぶ': 'ば',
    'ぷ': 'ぱ'
}

def u_to_a(text):
    last = text[-1]
    val = u_to_a_dict.get(last)
    if val is None:
        raise Exception(f"{last} not found")
    return text[:-1] + val